# Lesson 1: Data Munging Basics Practice Space

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

### Select and retrieve data

In [37]:
series_obj = Series(np.arange(5), index=['r1', 'r2', 'r3', 'r4', 'r5'])
series_obj

r1    0
r2    1
r3    2
r4    3
r5    4
dtype: int32

In [38]:
series_obj['r2']

1

In [39]:
series_obj[[2,3,4]]

r3    2
r4    3
r5    4
dtype: int32

In [34]:
np.random.seed(25)
df_obj = DataFrame(np.random.rand(25).reshape((5,5)),
                   index=['r1','r2','r3','r4','r5'],
                   columns=['c1','c2','c3','c4','c5'])
df_obj

          c1        c2        c3        c4        c5
r1  0.870124  0.582277  0.278839  0.185911  0.411100
r2  0.117376  0.684969  0.437611  0.556229  0.367080
r3  0.402366  0.113041  0.447031  0.585445  0.161985
r4  0.520719  0.326051  0.699186  0.366395  0.836375
r5  0.481343  0.516502  0.383048  0.997541  0.514244

In [40]:
df_obj.ix[['r2','r4','r5'],['c1','c5']]

C:\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          c1        c5
r2  0.117376  0.367080
r4  0.520719  0.836375
r5  0.481343  0.514244

In [44]:
df_obj.loc[['r2','r4','r5'],['c1','c5']]

          c1        c5
r2  0.117376  0.367080
r4  0.520719  0.836375
r5  0.481343  0.514244

In [46]:
series_obj['r2':'r4']

r2    1
r3    2
r4    3
dtype: int32

In [47]:
df_obj['r2':'r4']

          c1        c2        c3        c4        c5
r2  0.117376  0.684969  0.437611  0.556229  0.367080
r3  0.402366  0.113041  0.447031  0.585445  0.161985
r4  0.520719  0.326051  0.699186  0.366395  0.836375

In [58]:
df_obj>.2

       c1     c2    c3     c4     c5
r1   True   True  True  False   True
r2  False   True  True   True   True
r3   True  False  True   True  False
r4   True   True  True   True   True
r5   True   True  True   True   True

In [60]:
series_obj[series_obj>=2]

r3    2
r4    3
r5    4
dtype: int32

In [65]:
df_obj[df_obj<=.9]

          c1        c2        c3        c4        c5
r1  0.870124  0.582277  0.278839  0.185911  0.411100
r2  0.117376  0.684969  0.437611  0.556229  0.367080
r3  0.402366  0.113041  0.447031  0.585445  0.161985
r4  0.520719  0.326051  0.699186  0.366395  0.836375
r5  0.481343  0.516502  0.383048       NaN  0.514244

In [67]:
series_obj['r1','r3','r5']=15
series_obj

r1    15
r2     1
r3    15
r4     3
r5    15
dtype: int32

In [105]:
df_obj.replace(to_replace={'c2':{'r1':0.582277,'r5':0.516502},'c5':{'r4':0.836375}},value=0.799186) # Not working as expected

          c1        c2        c3        c4        c5
r1  0.870124  0.582277  0.278839  0.185911  0.411100
r2  0.117376  0.684969  0.437611  0.556229  0.367080
r3  0.402366  0.113041  0.447031  0.585445  0.161985
r4  0.520719  0.326051  0.699186  0.366395  0.836375
r5  0.481343  0.516502  0.383048  0.997541  0.514244

In [100]:
df_obj.replace(to_replace={'c2':{0.582277:0.699186}}, value=None) # Not working as expected

          c1        c2        c3        c4        c5
r1  0.870124  0.582277  0.278839  0.185911  0.411100
r2  0.117376  0.684969  0.437611  0.556229  0.367080
r3  0.402366  0.113041  0.447031  0.585445  0.161985
r4  0.520719  0.326051  0.699186  0.366395  0.836375
r5  0.481343  0.516502  0.383048  0.997541  0.514244